# Словари, методы dict()
# Часть 2. Итерация

# price = {'мясо': 3, 'хлеб': 1, 'картошка': 0.5, 'вода': 0.2}

# for i in price:   # Итерируються ключи словаря
#     print(i) #  мясо
#              #  хлеб
#              #  картошка
#              #  вода


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}

# for i in price:
#     price[i] = round(price[i] * 0.85, 2)
# print(price)  # {'мясо': 2.55, 'хлеб': 0.85, 'картошка': 0.42, 'вода': 0.17}


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# new_price = {}
# for i in price:
#     new_price[i] = round(price[i] * 0.85, 2)
# print(price)  # {'мясо': 3, 'хлеб': 1, 'картошка': 0.5, 'вода': 0.2}
# print(new_price) # {'мясо': 3, 'хлеб': 1, 'картошка': 0.5, 'вода': 0.2}


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# new_price = {}
# for i in price:
#     new_price[i] = round(price[i] * 0.85, 2)
# x = price.items()
# print(x) # dict_items([('мясо', 3), ('хлеб', 1), ('картошка', 0.5), ('вода', 0.2)])
# list(x)
# print(list(x)) # [('мясо', 3), ('хлеб', 1), ('картошка', 0.5), ('вода', 0.2)]


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# for i in price.items():
#     print(i) # ('мясо', 3)
# ('хлеб', 1)
# ('картошка', 0.5)
# ('вода', 0.2)

# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# for k, v in price.items():
#     print(k)
#     print(v)
# мясо
# 3
# хлеб
# 1
# картошка
# 0.5
# вода
# 0.2

# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# new = {}
# for k, v in price.items():
#     new[v] = k
#     print(new)
# {3: 'мясо'}
# {3: 'мясо', 1: 'хлеб'}
# {3: 'мясо', 1: 'хлеб', 0.5: 'картошка'}
# {3: 'мясо', 1: 'хлеб', 0.5: 'картошка', 0.2: 'вода'}


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}

# x = price.values()
# print(x)  # dict_values([3, 1, 0.5, 0.2])
# list(x)
# print(list(x))  # [3, 1, 0.5, 0.2]


# price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
# for v in price.values():
#     print(v)    # 3
                # 1
                # 0.5
                # 0.2
                

price = {"мясо": 3, "хлеб": 1, "картошка": 0.5, "вода": 0.2}
for k in price.keys():
    print(k)
            # мясо
            # хлеб
            # картошка
            # вода
    