# Цикл for, цикл в цикле и функция range.

# x = "абвгдеёжзиклмнопрстуфхцчшщьыъэюя"
# y = input("Введите строку:\n ")    # \n - это перенос строки.
# for i in x:
#     count = 0
#     for j in y:
#         if i == j:
#             count += 1
#     print("Букв", i, "было", count)

# x = "абвгдеёжзиклмнопрстуфхцчшщьыъэюя"
# y = input("Введите строку:\n ")    # \n - это перенос строки.
# for i in x:
#     count = 0
#     for j in y:
#         if i == j:
#             count += 1
#     if count > 0:
#         print("Букв", i, "было", count)
# ______________________________________________

# for i in range(stat, stop, step):  # У функции range 3-и параметра: Старт, стоп, шаг
# _______________________________________________________________________________________
# for i in range(10):  # Генерирует числа от 1 до 10, не включая 10.
#     print(i)

# for i in range(5, 10):  # Генерирует числа от 5 до 10, не включая 10.
#     print(i)


# for i in range(1, 10, 2):  # Генерирует числа от 1 до 10, не включая 10, с шагом 2.
#     print(i)


for i in range(10, -10, -2):  # Генерирует числа от 10 до -10, не включая 10, с шагом -2.
    print(i)
