# Открываем файл "text.txt" в режиме записи с кодировкой UTF-8
# Используем менеджер контекста для автоматической обработки операций с файлом
# Сначала определяем список путей
list_paths = [
    "path/to/first/file",
    "path/to/second/file",
    # Добавьте необходимые пути к файлам
]

with open("text.txt", "w", encoding="utf-8") as file:
    # Итерируемся по списку путей к файлам
    for path in list_paths:
        # Записываем каждый путь к файлу в текстовый файл, добавляя символ новой строки
        file.write(path + "\n")

# Чтение из файла и поиск определенной строки
# Для чтения открываем файл с использованием менеджера контекста
with open("text.txt", encoding="utf-8") as file:
    # Итерируемся по каждой строке в файле
    for line in file:
        # Проверяем наличие строки "read.py" в текущей строке
        if "read.py" in line:
            # Выводим строку, если она содержит "read.py"
            print(line)

# Копирование двоичного файла с использованием менеджера контекста
# Открываем исходный файл в режиме чтения байтов ('rb')
with open("PuntoSwitcherSetup.exe", "rb") as src:
    # Открываем целевой файл в режиме записи байтов ('wb')
    with open("Копия PuntoSwitcherSetup.exe", "wb") as dst:
        # Читаем исходный файл блоками по 1 МБ
        while True:
            # Читаем блок данных из исходного файла
            buffer = src.read(1048576)
            # Если блок пустой (конец файла), выходим из цикла
            if not buffer:
                break
            # Записываем блок данных в целевой файл
            dst.write(buffer)
# Выводим сообщение о завершении копирования
print("Контроль")
